DESCRIPTION

SFO Public Department, referred to as SFO, has captured the salary data of all its employees for the years 2011-2014. Now in 2018, the organization is facing some financial crisis. As a first step, HR wants to rationalize employee cost to save payroll budget. You have to perform data manipulation and answer the questions below:

1. How much total salary cost has increased from year 2011 to 2014?
2. Who was the top-earning employee across all the years?

Objective: Perform data manipulation and visualization techniques.

In [1]:
import pandas as pd
df = pd.read_csv('Salaries.csv')

C:\Users\srivi\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [2]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [3]:
year_2011 = df.groupby('Year').get_group(2011)['TotalPay'].sum()

In [4]:
year_2014 = df.groupby('Year').get_group(2014)['TotalPay'].sum()

In [5]:
diff = year_2014 - year_2011

In [6]:
# 1. How much total salary cost has increased from year 2011 to 2014?
diff

282797920.53999996

In [ ]:
# Who was the top-earning employee across all the years?

In [9]:
df.loc[df.groupby('Year')['TotalPay'].idxmax(),['EmployeeName','TotalPay','Year','JobTitle']]

,EmployeeName,TotalPay,Year,JobTitle
0,NATHANIEL FORD,567595.43,2011,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
36158,Gary Altenberg,362844.66,2012,"Lieutenant, Fire Suppression"
72925,Samson Lai,347102.32,2013,"Battalion Chief, Fire Suppress"
110529,David Shinn,471952.64,2014,Deputy Chief 3